{
  "liz_rice": {
    "index": 1,
    "key": "liz_rice",
    "photo": "liz-rice.webp",
    "name": "Liz Rice",
    "title": "Chief Open Source Officer",
    "company": "Isovalent",
    "twitter": "lizrice",
    "linkedin": "lizrice",
    "bio": "Liz Rice is Chief Open Source Officer with eBPF specialists Isovalent, creators of the Cilium project. She was chair of the CNCF's Technical Oversight Committee 2019-2022, and Co-Chair of KubeCon + CloudNativeCon in 2018. She is also the author of O'Reilly books \"Learning eBPF\" and \"Container Security\".",
    "session": "keynote01"
  },
  "kat_cosgrove": {
    "index": 2,
    "key": "kat_cosgrove",
    "photo": "kat_cosgrove.jpg",
    "name": "Kat Cosgrove",
    "title": "Lead Developer Advocate",
    "company": "Dell",
    "twitter": "Dixie3Flatline",
    "linkedin": "katcosgrove",
    "bio": "Kat is a Lead Developer Advocate at Dell focused on the growth and nurturing of open source through authentic contribution. In particular, her specialties are approachable 101-level content and deep dives on the history of technology, with a focus on DevOps and cloud native. She has served on the Kubernetes release team since v1.22. When she’s not at a conference, she spends her time playing video games, watching horror movies, or reading science fiction, but her current hyperfixation is film photography. She lives in Scotland with her cat, Espresso, who is the real brains behind the operation and actually ghostwriting all of her tweets.",
    "session": "keynote02"
  },
  "ayse_kaya": {
    "index": 3,
    "key": "ayse_kaya",
    "photo": "ayse-kaya.jpg",
    "name": "Ayse Kaya",
    "title": "Vice President of Strategy and Analytics",
    "company": "Root",
    "twitter": "aykayase",
    "linkedin": "aysekaya",
    "bio": "Ayse Kaya is the Vice President of Strategy and Analytics at Root.\n\nShe is an accredited data scientist and container enthusiast. A graduate of the MIT Sloan School of Management's Operations Research Center, Kaya was previously a strategy and analytics lead at CloudLock and Cisco Systems. Ayse Kaya lives in Boston with her daughter. She is an avid runner and student of philosophy.",
    "session": "ayse"
  },
  "viktor_farcic": {
    "index": 4,
    "key": "viktor_farcic",
    "photo": "viktor-farcic.png",
    "name": "Viktor Farcic",
    "title": "Developer Advocate",
    "company": "Upbound",
    "twitter": "vfarcic",
    "linkedin": "viktorfarcic",
    "bio": "Viktor Farcic is a lead rapscallion at Upbound, a member of the CNCF Ambassadors, Google Developer Experts, CDF Ambassadors, and GitHub Stars groups, and a published author.\n\nHe is a host of the YouTube channel DevOps Toolkit and a co-host of DevOps Paradox.",
    "session": "viktor-mauricio"
  },
  "mauricio_salatino": {
    "index": 5,
    "key": "mauricio_salatino",
    "photo": "mauricio-salatino.jpg",
    "name": "Mauricio \"Salaboy\" Salatino",
    "title": "OSS Software Engineer",
    "company": "Diagrid",
    "twitter": "salaboy",
    "linkedin": "salaboy",
    "bio": "Mauricio works as an Open Source Software Engineer at @Diagrid, contributing to and driving initiatives for the Dapr OSS project. Mauricio also serves as a Steering Committee member for the Knative Project and Co-Leading the Knative Functions initiative. He published a book titled Platform Engineering on Kubernetes for Manning Publishing and previously worked at VMware and Red Hat, building tools to help developers be more productive.",
    "session": "viktor-mauricio"
  },
  "kunal_kushwaha": {
    "index": 6,
    "key": "kunal_kushwaha",
    "photo": "kunal-kushwaha.jpg",
    "name": "Kunal Kushwaha",
    "title": "Developer Relations Manager",
    "company": "Civo",
    "twitter": "kunalstwt",
    "linkedin": "kunal-kushwaha",
    "bio": "Kunal is empowering communities via open-source and education. He finds passion in teaching and has taught thousands of folks online and in person. He is a developer relations manager at Civo, CNCF Ambassador, TEDx speaker and a GitHub Star. He is the founder of WeMakeDevs and also started the official Cloud Native Student Community group joined by thousands of folks, focussed on getting more young people involved in the ecosystem. In the past he has been a track chair of the KubeCon + CloudNativeCon, Major League Hacking Coach and a Google Summer of Code mentor.",
    "session": "kunal-aakansha"
  },
  "aakansha_priya": {
    "index": 7,
    "key": "aakansha_priya",
    "photo": "aakansha-priya.jpeg",
    "name": "Aakansha Priya",
    "title": "DevRel",
    "company": "EmpathyOps",
    "twitter": "AakanshaPriya_",
    "linkedin": "aakansha-priya-1782b91a0",
    "bio": "Aakansha is a DevRel at EmpathyOps. Working on empowering & upscaling the communities. In the past she has been a Community Manager at Hashnode. As a frontend dev turned DevOps explorer, loves sharing tech insights, views on learning & building in public, blogging & building personal brand. A reader and speaker, Aakansha paints, sings and loves spontaneous travel. Catch her at meetups & conferences!\n",
    "session": "kunal-aakansha"
  },
  "engin_diri": {
    "index": 8,
    "key": "engin_diri",
    "photo": "engin-diri.jpg",
    "name": "Engin Diri",
    "title": "Senior Solutions Architect",
    "company": "Pulumi",
    "twitter": "_ediri",
    "linkedin": "engin-diri",
    "bio": "Engin is a Senior Solutions Architect at Pulumi and has been in the IT industry for over 15 years.\n\nHe started as a Java backend developer and later migrated to the fronted development.\n\nThis is where he found his passion for CI/CD, Cloud technologies and in particular Kubernetes.\n\nEngin is a very curious person and loves learning and testing new technologies.",
    "session": "engin"
  },
  "katharina_sick": {
    "index": 9,
    "key": "katharina_sick",
    "photo": "katharina-sick.jpg",
    "name": "Katharina Sick",
    "title": "Software Engineer",
    "company": "Dynatrace",
    "twitter": "kathi_sick",
    "linkedin": "katharinasick",
    "bio": "I'm all about making things user-friendly, especially when it comes to Cloud Native and Kubernetes.\n\nI've done a fair share of mobile app and backend work, but lately, I'm really into Cloud Native computing and enjoy it a lot.\n\nOutside of work, you'll find me hanging out in tech and sports communities, cruising on inline skates, exploring new places, or challenging myself with quizzes and games.",
    "session": "katharina-thomas"
  },
  "thomas_labarussias": {
    "index": 10,
    "key": "thomas_labarussias",
    "photo": "thomas-labarussias.jpeg",
    "name": "Thomas Labarussias",
    "title": "Senior Developer Advocate",
    "company": "Sysdig",
    "twitter": "TLabarussias",
    "linkedin": "thomas-labarussias-9229b522a",
    "bio": "Thomas is Senior Developer Advocate at Sysdig, the company which created and open-sourced Falco, the Security Runtime Engine for Kubernetes and Cloud-Native technologies. Thomas worked for Qonto, a modern banking for SMEs and freelancers, where he managed their Kubernetes clusters and the enthusiastic tools around, like ArgoCD, Traefik, Prometheus. He also assisted for many years pure-players and e-business companies for a large managed service provider, as an AWS expert and FinOps. He's one of the longest tenured members of the Falco community, and creator of Falcosidekick and Falcosidekick-UI, two major components of the Falco ecosystem.",
    "session": "katharina-thomas"
  },
  "hasan_turken": {
    "index": 11,
    "key": "hasan_turken",
    "photo": "hasan-turken.jpg",
    "name": "Hasan Türken",
    "title": "Principal Software Engineer",
    "company": "Upbound",
    "twitter": "turkenh",
    "linkedin": "turkenh",
    "bio": "Hasan Türken is a software engineer with a focus on Kubernetes. Certified as a Kubernetes Administrator (CKA) and Security Specialist (CKS), he has extensive experience in containerizing enterprise applications and guiding cloud-native development. At Upbound, the company behind Crossplane, he leverages his passion for the Kubernetes control plane to innovate SaaS solutions and automation. Hasan is an enthusiast of Golang, open-source software, and all things Kubernetes.",
    "session": "hasan"
  },
  "alessandro_vozza": {
    "index": 12,
    "key": "alessandro_vozza",
    "photo": "alessandro-vozza.png",
    "name": "Alessandro Vozza",
    "title": "CNCF Ambassador",
    "company": "",
    "twitter": "bongo",
    "linkedin": "alessandrovozza",
    "bio": "Community leader and CNCF ambassador, Alessandro has spent the last few years building cloud native infrastructures for Microsoft customers, animating the Dutch community, and training others to pass the CKx exams. He has passion for all things cloud native, he's been around open source for 25 years and recently moved to a new Developer Relations role.",
    "session": "alessandro"
  },
  "utku_darilmaz": {
    "index": 13,
    "key": "utku_darilmaz",
    "photo": "utku-darilmaz.png",
    "name": "Utku Darilmaz",
    "title": "Site Reliability Engineer",
    "company": "Firefly",
    "twitter": "utkudarilmaz",
    "linkedin": "utkudarilmaz",
    "bio": "Utku is a passionate DevOps Engineer currently based in Dubai. With more than five years of experience in the field, he has developed a strong proficiency in a wide range of DevOps & SysOps practices. His expertise includes designing cloud architectures, implementing CI/CD strategies, designing system architectures, improving DevOps cultures, utilizing GitOps practices, and deploying software in various environments based on their specific requirements. He is passionate about learning & sharing.",
    "session": "utku"
  },
  "edith_puclla": {
    "index": 14,
    "key": "edith_puclla",
    "photo": "edith-puclla.jpg",
    "name": "Edith Puclla",
    "title": "Technology Evangelist",
    "company": "Percona",
    "twitter": "EdithPuclla",
    "linkedin": "edithpuclla",
    "bio": "Edith Puclla is from Peru. CNCF Ambassador, Docker Captain, and Technology Evangelist at Percona. She is also an Open Source contributor, participating in SIG-docs, helping to translate the official Kubernetes documentation to Spanish, and SIG-Operators giving feedback and participating in weekly meetings. She also holds the title of ambassador of the Cloud Native Computing Foundation and is a Docker captain. Recently, she took an important step by moving to the UK on a Global Talent Visa.",
    "session": "edith"
  },
  "mohammed_fazalullah_qudrath": {
    "index": 15,
    "key": "mohammed_fazalullah_qudrath",
    "photo": "mohammed-fazalullah-qudrath.png",
    "name": "Mohammed Fazalullah Qudrath",
    "title": "Senior Developer Advocate",
    "company": "Amazon Web Services",
    "twitter": "_cloudranger",
    "linkedin": "mohammedfazalullah",
    "bio": "Mohammed Fazalullah \"Faz\" is a Senior Developer Advocate at AWS and educates and empowers developers on achieving cloud capabilities, allowing them to concentrate on interesting problems. An architect and a technical evangelist at heart, he speaks on various trends in the containers and observability space with the focus of building and scaling in the cloud in and around Asia and Europe.",
    "session": "mohammed-rewanth"
  },
  "furkan_turkal": {
    "index": 17,
    "key": "furkan_turkal",
    "photo": "furkan-turkal.png",
    "name": "Furkan Türkal",
    "title": "Platform Engineer",
    "company": "Trendyol",
    "twitter": "furkanturkaI",
    "linkedin": "furkanturkal",
    "bio": "Furkan likes to design and implement new tech stacks with a deep focus on distributed and low-level systems. He is interested in contributing to open-source projects, communities, and project management. Strong interest in the CNCF world! Recently, he has been researching Supply Chain Security.",
    "session": "emin-furkan"
  },
  "emin_aktas": {
    "index": 18,
    "key": "emin_aktas",
    "photo": "emin-aktas.jpg",
    "name": "Emin Aktas",
    "title": "Senior Site Reliability Engineer",
    "company": "Axon Networks",
    "twitter": "emminaktas",
    "linkedin": "aktas55",
    "bio": "Emin is a person who loves target-driven, versatile and cares about innovative ideas. He enjoys process management and communication. He never hesitates to share his experience on Medium. Not only that, he strongly interested in combination of fields of mechanics, hardware and software. He wants to be more efficient on CNCF projects in the future.",
    "session": "emin-furkan"
  },
  "jona_apelbaum": {
    "index": 19,
    "key": "jona_apelbaum",
    "photo": "jona-apelbaum.jpg",
    "name": "Jona Apelbaum",
    "title": "Solution Engineering Manager",
    "company": "Wiz",
    "twitter": "japelbaum",
    "linkedin": "apelbaumj",
    "bio": "15 years of experience working with a broad range of technologies, where the last 5+ years have been evolving around Cloud Native technologies (Kubernetes, Docket IaC, etc..). \n Experience working with customers ranging from SMB’s to large enterprise customers. Considerable experience building and maintaining relationships at all levels and utilizing my network to achieve success.",
    "session": "jona-nicolas"
  },
  "nicolas_ehrman": {
    "index": 20,
    "key": "nicolas_ehrman",
    "photo": "nicolas-ehrman.jpeg",
    "name": "Nicolas Ehrman",
    "title": "Product Marketing Manager",
    "company": "Wiz",
    "twitter": "MyVW0rld",
    "linkedin": "nicolas-ehrman-629b8910",
    "bio": "Nicolas is a product marketing manager at Wiz and focuses mainly on the security of containerized environments and cloud-native applications. For over 20 years in IT, he has specialized in cloud infrastructure, automation and security, and has worked for companies such as EMC, Red Hat and HashiCorp. Outside of work, he loves traveling, discovering new cultures, and especially the foods of all over the world.",
    "session": "jona-nicolas"
  },
  "mustafa_yumurtaci": {
    "index": 21,
    "key": "mustafa_yumurtaci",
    "photo": "mustafa-yumurtaci.png",
    "name": "Mustafa Yumurtacı",
    "title": "Platform Engineer",
    "company": "Trendyol",
    "twitter": "",
    "linkedin": "mustafayumurtaci",
    "bio": "",
    "session": "erkan-mustafa"
  },
  "erkan_zileli": {
    "index": 22,
    "key": "erkan_zileli",
    "photo": "erkan-zileli.jpg",
    "name": "Erkan Zileli",
    "title": "Platform Engineer",
    "company": "Trendyol",
    "twitter": "erkanzileli",
    "linkedin": "erkanzileli",
    "bio": "",
    "session": "erkan-mustafa"
  },
  "ali_ok": {
    "index": 23,
    "key": "ali_ok",
    "photo": "ali-ok.jpeg",
    "name": "Ali Ok",
    "title": "Principal Software Engineer",
    "company": "Red Hat",
    "twitter": "aliok_tr",
    "linkedin": "aliok",
    "bio": "Ali Ok works for Red Hat as a principal software engineer. He is a Knative steering committee member and works with working groups within Knative.\n\nBesides the technical contributions to Knative and many CNCF projects, Ali is a CNCF Ambassador and a regular contributor to the CNCF TAG Contributor Strategy, where he helps projects with mentorship programs, governance improvements and contributor growth suggestions.",
    "session": "aliok"
  },
  "onur_beygo": {
    "index": 26,
    "key": "onur_beygo",
    "photo": "onur-beygo.jpg",
    "name": "Onur Beygo",
    "title": "Senior Engineering Manager",
    "company": "Mambu",
    "twitter": "",
    "linkedin": "hobeygo",
    "bio": "Onur is an engineering leader who has a broad range of experience in cloud infrastructure, data, observability and DevEx areas. He has seen the highs and lows of defence, manufacturing and finance industries and continuing his journey as a Senior Engineering Manager for Builder Experience in Mambu. Born & raised in the Anatolian heartland, he enjoys the tranquility of the Dutch countryside for the last few years .",
    "session": "onur"
  },
  "akin_ozer": {
    "index": 27,
    "key": "akin_ozer",
    "photo": "akin-ozer.jpeg",
    "name": "Akin Ozer",
    "title": "Senior DevOps Engineer",
    "company": "Moonfare",
    "twitter": "ozer_akn",
    "linkedin": "akin-ozer",
    "bio": "Akin Ozer is a seasoned DevOps engineer and a recognized expert in Kubernetes infrastructure. With over 5 years of experience in cloud computing and container orchestration, Akin Ozer has led several projects focused on optimizing Kubernetes clusters for scalability and efficiency. He currently works at Moonfare, where he is working on making this fintech company efficient with the latest technologies in Kubernetes environments.",
    "session": "akin"
  },
  "henrik_rexed": {
    "index": 28,
    "key": "henrik_rexed",
    "photo": "henrik-rexed.jpg",
    "name": "Henrik Rexed",
    "title": "Cloud Native Advocate",
    "company": "Dynatrace",
    "twitter": "hrexed",
    "linkedin": "hrexed",
    "bio": "Henrik is a Cloud Native Advocate at Dynatrace, the leading Observability platform. Prior to Dynatrace, Henrik has  worked more than 15 years, as Performance Engineer. Henrik Rexed Is Also one of the Organizer of the conferences named WOPR, KCD Austria and the owner of the Youtube Channel IsitObservable.",
    "session": "henrik"
  },
  "tobias_schneck": {
    "index": 29,
    "key": "tobias_schneck",
    "photo": "tobias-schneck.png",
    "name": "Tobias Schneck",
    "title": "Principal Architect",
    "company": "Kubermatic",
    "twitter": "toschneck",
    "linkedin": "toschneck",
    "bio": "Tobias Schneck is a Principal Architect at Kubermatic, an open-source platform for Kubernetes management. He is a passionate advocate for open-source technologies and has a deep understanding of cloud-native infrastructure. Tobias has over 10 years of experience in the IT industry and has held various positions in development, operations, and architecture. Bringing the advantages of cloud native technologies and development workflows to everybody is his aim.",
    "session": "tobias"
  },
  "mustafa_akin": {
    "index": 30,
    "key": "mustafa_akin",
    "photo": "mustafa-akin.jpg",
    "name": "Mustafa Akın",
    "title": "Engineering Manager",
    "company": "JumpCloud",
    "twitter": "mustafaakin",
    "linkedin": "mustafaakin",
    "bio": "Mustafa Akın, an engineering manager at JumpCloud with past roles at Atlassian and Opsgenie, has a diverse background in Linux and Kubernetes. He has been involved with Docker since 2013 and actively shares his knowledge on software development and Kubernetes on his blog. Mustafa also embarked on a PhD journey, focusing on Kubernetes scheduling algorithms, before deciding to leave academia.",
    "session": "mustafa"
  },
  "kenan_faruk_cakir": {
    "index": 31,
    "key": "kenan_faruk_cakir",
    "photo": "kenan-faruk-cakir.jpg",
    "name": "Kenan Faruk Çakır",
    "title": "Founding Engineer",
    "company": "Anteon",
    "twitter": "",
    "linkedin": "kenan-faruk-cakir",
    "bio": "Kenan is a founding engineer at Anteon, an open-source Kubernetes monitoring solution. He has a strong experience in distributed systems and architecture.",
    "session": "sponsor01",
    "hiddenInSpeakersView": true
  }
}
